nbd_fio_results/dev-nbd0_2023-07-17_17:16/rand_w_nbd0_1iodepth_1threads/4096.txt
rand-write: (g=0): rw=randwrite, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

rand-write: (groupid=0, jobs=1): err= 0: pid=13556: Mon Jul 17 17:17:03 2023
  write: IOPS=362, BW=1451MiB/s (1521MB/s)(28.3GiB/20001msec)
    slat (usec): min=127, max=3874, avg=1468.89, stdev=396.75
    clat (usec): min=492, max=5162, avg=1269.79, stdev=410.04
     lat (usec): min=2377, max=5651, avg=2754.04, stdev=146.53
    clat percentiles (usec):
     |  1.00th=[  742],  5.00th=[  840], 10.00th=[  898], 20.00th=[  971],
     | 30.00th=[ 1037], 40.00th=[ 1090], 50.00th=[ 1156], 60.00th=[ 1221],
     | 70.00th=[ 1287], 80.00th=[ 1450], 90.00th=[ 1942], 95.00th=[ 2245],
     | 99.00th=[ 2507], 99.50th=[ 2573], 99.90th=[ 2704], 99.95th=[ 2737],
     | 99.99th=[ 5145]
   bw (  MiB/s): min= 1400, max= 1536, per=99.99%, avg=1450.80, stdev=42.55, samples=40
   iops        : min=  350, max=  384, avg=362.70, stdev=10.64, samples=40
  lat (usec)   : 500=0.01%, 750=1.14%, 1000=22.19%
  lat (msec)   : 2=67.64%, 4=9.00%, 10=0.01%
  cpu          : usr=2.88%, sys=5.04%, ctx=211336, majf=0, minf=533
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7255,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1451MiB/s (1521MB/s), 1451MiB/s-1451MiB/s (1521MB/s-1521MB/s), io=28.3GiB (30.4GB), run=20001-20001msec

Disk stats (read/write):
  nbd0: ios=0/230841, merge=0/0, ticks=0/253120, in_queue=227364, util=94.31%